<script>
	import Icon from '../../Icon.svelte';
</script>

<div>
	<div class="max-w-[54rem]">
		<h1 class="text-2xl text-ctp-text mb-2">
			<span class="animate-pulse drop-shadow-glow-ctp-yellow text-ctp-yellow">Світловий</span> дизайн
		</h1>
		<div class="text-ctp-subtext0 space-y-4">
			<p>
				Перше, що важливо знати – освітлення в інтер’єрі буває двох типів: функціональне і
				декоративне.
			</p>
			<div class="flex flex-col space-y-4 md:flex-row md:space-x-4 md:space-y-0">
				<img
					src="../school/img/1.jpg"
					alt="перша картинка"
					class="h-48 w-fit rounded-2xl outline outline-2 outline-ctp-rosewater"
				/>
				<img
					src="../school/img/2.jpg"
					alt="друга картинка"
					class="h-48 w-fit rounded-2xl outline outline-2 outline-ctp-rosewater"
				/>
			</div>
			<p>
				З визначень ясно, що завдання першого – зробити кімнату комфортною для перебування в ній, а
				другого – доповнити інтер’єр деталями, приємними оку і урізноманітнити оформлення.
			</p>
			<p>
				Недооцінювати декоративне освітлення не можна. Воно робить образ житла особливим і, що ще
				важливіше, довершенним. Більш того, за допомогою додаткових джерел світла можна ненав’язливо
				зонувати простір і працювати з візуальним сприйняттям габаритів приміщення.
			</p>
			<p>
				Дизайн світильників – це дуже важливо, однак все ж набагато важливіше правильно відведена
				освітлювального приладу роль в світлодизайн інтер’єру. Для цього необхідно заздалегідь
				продумати, де повиненно бути основне джерело світла, де потрібна підсвічування, а де –
				акцентне світло.
			</p>
			<div class="flex flex-col space-y-4 md:flex-row md:space-x-4 md:space-y-0">
				<img
					src="../school/img/4.jpg"
					alt="картинка"
					class="h-48 w-fit rounded-2xl outline outline-2 outline-ctp-rosewater"
				/>
				<img
					src="../school/img/3.webp"
					alt="картинка"
					class="h-48 w-fit rounded-2xl outline outline-2 outline-ctp-rosewater"
				/>
			</div>
			<p>
				Головне, щоб розташування приладів було логічно виправдано, як кожна репліка в театральному
				сценарії. Зазвичай освітлення визначають, як завершальний штрих в оформленні інтер’єру. І це
				можна назвати грубою помилкою з точки зору професійного дизайну. Справа в тому, що в
				готовому інтер’єрі розставити освітлювальні прилади довільно, як хотілося б, досить складно.
				А виною тому, як правило, непродумане розташування розеток. Так, проектувати сценарій
				майбутнього освітлення краще заздалегідь. Так, ви зможете зрозуміти, яке розташування
				розеток в кімнаті буде оптимальним і не мучитися з цим питанням по завершенню ремонту.
			</p>
		</div>
	</div>

	<div class="mt-12 max-w-[54rem]">
		<h1 class="text-2xl text-ctp-text mb-2">
			<span class="drop-shadow-glow-ctp-green text-ctp-green">Біо</span>дизайн
		</h1>
		<div class="text-ctp-subtext0 space-y-4">
			<p>
				Застосовуючи біологічні принципи в графічній діяльності, художник-дизайнер намагається
				розкрити в природному аналогу особливий естетичний вигляд закономірностей. До використання
				природних форм потрібно підходити творчо, інакше не вдасться отримати бажані результати.
			</p>
			<div class="flex flex-col space-y-4 md:flex-row md:space-x-4 md:space-y-0">
				<img
					src="../school/img/5.webp"
					alt="картинка"
					class="h-48 w-fit rounded-2xl outline outline-2 outline-ctp-green"
				/>
			</div>
			<p>
				Специфічна риса сучасного етапу освоєння форм живої природи в матеріальному світі полягає в
				тому, що зараз освоюються не просто формальні сторони живої природи, а встановлюються
				глибокі зв'язки між законами розвитку живої природи і предметного світу. На сучасному етапі
				дизайнерами використовуються не зовнішні форми живої природи, а лише ті властивості і
				характеристики форми, які є виразом функції того чи іншого організму, аналогічним
				функціонально-утилітарних сторін графічної форми. Від функції до форми і до закономірностей
				формоутворення - такий основний шлях дизайнерської біоніки.
			</p>
			<div class="flex flex-col space-y-4 md:flex-row md:space-x-4 md:space-y-0">
				<img
					src="../school/img/6.jpg"
					alt="картинка"
					class="h-48 w-fit rounded-2xl outline outline-2 outline-ctp-green"
				/>
			</div>
			<p>
				Природні форми (біоформи) мають такі властивості: гармонійна і раціональна
				конструктивно-композиційна угруповання елементів, їх красива ритміка; єдність ладу всіх
				елементів об'єкта; гармонія краси і доцільності. Найбільш відповідальний етап в роботі
				дизайнера - це дослідження живої природи. На цьому етапі неминуче постає питання, що
				вибирати в природі і як вибирати. Основним методом биодизайна є метод функціональних
				аналогій, Або зіставлення принципів і засобів формоутворення об'єктів дизайну і живої
				природи.
			</p>
			<div class="flex flex-col space-y-4 md:flex-row md:space-x-4 md:space-y-0">
				<img
					src="../school/img/7.jpg"
					alt="картинка"
					class="h-48 w-fit rounded-2xl outline outline-2 outline-ctp-green"
				/>
			</div>
		</div>
	</div>
	<h2 class="mt-12 text-2xl text-ctp-text text-center">
		Дякую за перегляд! <span class="animate-pulse text-3xl drop-shadow-glow-ctp-red">❤️</span>
	</h2>
</div>
